import easygui as g
g.msgbox(
    msg = '''
    CZ工作室将于2023年1月21日
    （时间）
    举行新年直播
    ''',
    title = "CZ工作室新年直播"
    )
g.msgbox(
    msg='''
    直播主持人：陈致
    直播工作人员：
    直播软件：腾讯会议
    直播链接：https://meeting.tencent.com/dm/RFxYnckxknbx #腾讯会议：723-159-461
    密码：113221
    [CW审核通过]
    ''',
    title = "CZ工作室新年直播"
    )
g.msgbox(
    msg='''
    CZ工作室新年直播条例
    ''',
    title = "CZ工作室新年直播"
    )
g.msgbox(
    msg='''
    基本条例：
    1.【防崩溃】禁止刷屏，反复开关摄像头，麦克风和举手功能（一分钟内共开关5次）
    ''',
    title = "CZ工作室新年直播"
    )
g.msgbox(
    msg='''
    2.【正常行规】禁止在聊天区发送黄赌毒、脏话。禁止把虚拟背景设置成与黄赌毒，脏话有关的图片、视频。成员禁止截图，录屏。禁止在未经允许的情况下在本会议中做广告。
    ''',
    title = "CZ工作室新年直播"
    )
g.msgbox(
    msg='''
    3.【聊天区】欢迎各位成员在聊天区分享你的意见，但不要因为一些小事，去进行吵架，辱骂，诅咒等事件！
    ''',
    title = "CZ工作室新年直播"
    )
g.msgbox(
    msg='''
    拓展条例：
    1.【麦克风】请你的麦克风保持常闭状态，除了室长允许外，一定要把麦克风关闭！会有很吵的杂音的！
    ''',
    title = "CZ工作室新年直播"
    )
g.msgbox(
    msg='''
    违反处罚：
    ''',
    title = "CZ工作室新年直播"
    )
g.msgbox(
    msg='''
    【基本条例】
1.违反 防崩溃 条例的参会者，违反三次踢出。
2.违反 正常行规  聊天区 条例的参会者，违反一次踢出。
    ''',
    title = "CZ工作室新年直播"
